import React from "react";
import UnitNavigation from "../components/UnitNavigation";
import Post from "../components/Post";
import { useState } from "react";
import Pagination from "../components/parts/Pagination";
import lesson1 from "../images/1.jpg";
import lesson2 from "../images/11.jpg";
import lesson3 from "../images/12.jpg";
import lesson4 from "../images/6.jpg";
import lesson5 from "../images/13.jpg";
import lesson6 from "../images/9.jpg";
import Intro2 from "../components/Intro2";
import intro from "../images/5.jpg";
import Test2 from "../components/Test2";
const Unit2 = () => {
  const [pageNumber, setPageNumber] = useState(0);
  return (
    <div className="container">
      <UnitNavigation name="الثانية" />
      <Pagination setPageNumber={setPageNumber} />
      {pageNumber === 0 ? <Intro2 lNumber="المقدمة" img={intro} /> : ""}
      {pageNumber === 1 ? (
        <Post
          img={lesson1}
          unitName="أسرة متحابة"
          lNumber="الأول/ تفهم دور و مسئوليات الفرد في الأسرة"
          modrakat={["مسئولية الفرد تجاه الجماعة", "مظاهر تقبل المسئولية"]}
          ahdafM={[
            " توضح ثلاثة امثلة لدورها تجاه اسرتها.",
            "تعدد عملين من االعمال الجماعية التي يمكنها االسهام فيها.",
            "تستنتج مظاهر تقبل المسئولية من الصور و الفيديو المعروض.",
          ]}
          ahdafW={[
            "تقدر أهمية التعاون في الاسرة وفي المدرسة.",
            "تهتم بإستغلال الموارد المتاحة لديها للمشاركة الفعالة فى المنزل والمدرسة.",
            "تهتم بالمشاركة في بعض المسئوليات االسرية والمدرسية.",
            "تفخر بدورها الإيجابي و الفعال نحو اسرتها وزميلاتها.",
          ]}
          strategies={[
            "الدراسة الذاتية عبر شبكة االأنترنت.",
            "الدراسة التقليدية وجها لوجه لمناقشة الانشطة و التكليفات و الاجابة عن الاستفسارات .",
          ]}
          methods={[
            "تحميل محتوى الموضوع من على موقع (البرنامج) .",
            "مناقشة التكليفات و الاجابة عن الاستفسارات في حجرة الدراسة التقليدية .",
            "الاستفادة من بعض المراجع و المواقع الاضافية الخاصة بالموضوع .",
            "المناقشة المفتوحة بين المعلمة و المتعلمات و بين المتعلمات وبعضهن البعض من خلال غرف الدردشة .",
            "العمل التعاونى (الجماعى) لتنفيذ بعض الأنشطة .",
          ]}
          view="https://drive.google.com/file/d/1Q9_zSD_LCtqKSe9ONVx1dTLay6kBnAMe/view?usp=sharing"
          download="https://drive.google.com/u/0/uc?id=1Q9_zSD_LCtqKSe9ONVx1dTLay6kBnAMe&export=download"
        />
      ) : (
        ""
      )}
      {pageNumber === 2 ? (
        <Post
          img={lesson2}
          lNumber="الثانى/ العوامل المؤثرة علي دور الفرد في الأسرة"
          unitName="أسرة متحابة"
          modrakat={[
            "العوامل المؤثرة علي دور الفرد في الأسرة . (السن - الحالة الصحية - الميول والرغبات - العوامل المالية)",
            "نظم تقسيم العناصر الغذائية .",
            " فائدة كل مجموعة من مجموعات الغذاء .",
          ]}
          ahdafM={[
            " تعدد العوامل المؤثرة علي دور الفرد في االسرة  .",
            "تبين كيف يؤثر كلا من السن و الحالة الصحية علي دور الفرد في الأسرة .",
            "توضح تأثير استخدامها للأدوات والاجهزة الحديثة علي اداؤها في المنزل .",
          ]}
          ahdafW={[
            "تهتم بأن يكون لها دور فعال في اسرتها.",
            "تحسن استخدام الموارد المتاحة لديها لرفع المستوى المالي ألسرتها.",
          ]}
          strategies={[
            "الدراسة الذاتية عبر شبكة االأنترنت.",
            "الدراسة التقليدية وجها لوجه لمناقشة الانشطة و التكليفات و الاجابة عن الاستفسارات .",
          ]}
          methods={[
            "تحميل محتوى الموضوع من على موقع (البرنامج) .",
            "مناقشة التكليفات و الاجابة عن الاستفسارات في حجرة الدراسة التقليدية .",
            "الاستفادة من بعض المراجع و المواقع الاضافية الخاصة بالموضوع .",
            "المناقشة المفتوحة بين المعلمة و المتعلمات و بين المتعلمات وبعضهن البعض من خلال غرف الدردشة .",
            "العمل التعاونى (الجماعى) لتنفيذ بعض الأنشطة .",
          ]}
          view="https://drive.google.com/file/d/1Gon1l8PH9on1HeBq9wjqMT01vSnTD6UY/view?usp=sharing"
          download="https://drive.google.com/u/0/uc?id=1Gon1l8PH9on1HeBq9wjqMT01vSnTD6UY&export=download"
        />
      ) : (
        ""
      )}
      {pageNumber === 3 ? (
        <Post
          img={lesson3}
          lNumber="الثالث/ أثاث المسكن"
          unitName="أسرة متحابة"
          modrakat={[
            "شروط اختيار اثاث المسكن.",
            "الاثاث المناسب للحجرات المختلفة. ",
            " المناطق الاساسية التي يتكون منها المسكن",
            "ملائمة اثاث كل حجرة لتلبية حاجات ورغبات افراد الأسرة",
          ]}
          ahdafM={[
            " تذكر اربعة شروط الختيار اثاث المسكن .",
            "تستنتج العالقة بين عدد افراد االسرة واختيار االثاث المناسب للمسكن .",
            "توضح المناطق االساسية التي يتكون منها المسكن .",
            " تعطى مثالين علي االثاث المتعدد االستخدامات.",
            "تذكر طرق الطهي المستخدمة .",
          ]}
          ahdafW={[
            "تقدر أهمية ترتيب المنزل للشعور بالراحة والجمال.",
            "تراعي الدقة في اختيار اثاث مسكنها.",
            "تشارك اسرتها في اختيار اثاث المنزل.",
            "تقدر اهمية الاثاث متعدد الاستخدام في المنزل صغير المساحة.",
            "تحافظ علي رونق اثاث مسكنها ليعيش مدة اطول.",
            "تفخر بدورها الايجابي نحو اسرتها.",
          ]}
          strategies={[
            "الدراسة الذاتية عبر شبكة االأنترنت.",
            "الدراسة التقليدية وجها لوجه لمناقشة الانشطة و التكليفات و الاجابة عن الاستفسارات .",
          ]}
          methods={[
            "تحميل محتوى الموضوع من على موقع (البرنامج) .",
            "مناقشة التكليفات و الاجابة عن الاستفسارات في حجرة الدراسة التقليدية .",
            "الاستفادة من بعض المراجع و المواقع الاضافية الخاصة بالموضوع .",
            "المناقشة المفتوحة بين المعلمة و المتعلمات و بين المتعلمات وبعضهن البعض من خلال غرف الدردشة .",
            "العمل التعاونى (الجماعى) لتنفيذ بعض الأنشطة .",
          ]}
          view="https://drive.google.com/file/d/1CNnpwYhMy_m66RkZ32m3B-I3bKY3RQ36/view?usp=sharing"
          download="https://drive.google.com/u/0/uc?id=1CNnpwYhMy_m66RkZ32m3B-I3bKY3RQ36&export=download"
        />
      ) : (
        ""
      )}
      {pageNumber === 4 ? (
        <Post
          img={lesson4}
          lNumber="الرابع/ العناية بأثاث المسكن"
          unitName="أسرة متحابة"
          modrakat={[
            "اهمية العناية بأثاث المسكن.",
            "طريقة عمل البيتزا .",
            " أنواع المواد التي يصنع منها الاثاث.",
            "كيفية تنظيف وتلميع قطع الاثاث المختلفة بطرق امنه.",
          ]}
          ahdafM={[
            " توضح اهمية العناية بأثاث المسكن.",
            "تعدد نوعين من المواد التي يصنع منها الاثاث.",
            "تشرح كيفية تنظيف الاثاث المنجد كما شاهدته في الفيديو المعروض.",
            " تبين أهمية ترشيد الاستهلاك للمنظفات علي الصحة.",
            "تستنتج القيمة الغذائية للبيتزا .",
            "تحسب تكاليف االصنف التي قامت بعمله .",
          ]}
          ahdafW={[
            "تهتم بالحصول علي معلومات للعناية بأثاث منزلها.",
            "تحافظ علي رونق اثاث منزلها ليعيش مدة اطول.",
            "تشارك اسرتها في العناية بأثاث منزلها.",
          ]}
          strategies={[
            "الدراسة الذاتية عبر شبكة االأنترنت.",
            "الدراسة التقليدية وجها لوجه لمناقشة الانشطة و التكليفات و الاجابة عن الاستفسارات .",
          ]}
          methods={[
            "تحميل محتوى الموضوع من على موقع (البرنامج) .",
            "مناقشة التكليفات و الاجابة عن الاستفسارات في حجرة الدراسة التقليدية .",
            "الاستفادة من بعض المراجع و المواقع الاضافية الخاصة بالموضوع .",
            "المناقشة المفتوحة بين المعلمة و المتعلمات و بين المتعلمات وبعضهن البعض من خلال غرف الدردشة .",
            "العمل التعاونى (الجماعى) لتنفيذ بعض الأنشطة .",
          ]}
          view="https://drive.google.com/file/d/1dvYMUsp8iKVRPNAYilFDRgYEDF6kGjoY/view?usp=sharing"
          download="https://drive.google.com/u/0/uc?id=1dvYMUsp8iKVRPNAYilFDRgYEDF6kGjoY&export=download"
        />
      ) : (
        ""
      )}
      {pageNumber === 5 ? (
        <Post
          img={lesson5}
          lNumber="الخامس/ تجميل المسكن"
          unitName="أسرة متحابة"
          modrakat={[
            "وسائل تجميل المسكن.",
            "تنفيذ خدادية .",
            "الخامات و المواد الالزمة لعمل الخدادية .",
            "طريقة عمل الخدادية.",
          ]}
          ahdafM={[
            "تعدد ثلاث وسائل لتجميل مسكنها من خلال مشاهدة الصور .",
            "تذكر الخامات و المواد اللازمة لعمل الخدادية .",
            "تشرح طريقة عمل الخدادية .",
            "توضح وسيلتين لتجميل الخدادية كما شاهدت في الصور.",
          ]}
          ahdafW={[
            "تقدر أهمية تجميل منزلها بالوسائل المختلفة.",
            "تهتم بنظافة المكان اثناء وبعد العمل.",
            "تفخر بما تصنعه بنفسها.",
          ]}
          strategies={[
            "الدراسة الذاتية عبر شبكة االأنترنت.",
            "الدراسة التقليدية وجها لوجه لمناقشة الانشطة و التكليفات و الاجابة عن الاستفسارات .",
          ]}
          methods={[
            "تحميل محتوى الموضوع من على موقع (البرنامج) .",
            "مناقشة التكليفات و الاجابة عن الاستفسارات في حجرة الدراسة التقليدية .",
            "الاستفادة من بعض المراجع و المواقع الاضافية الخاصة بالموضوع .",
            "المناقشة المفتوحة بين المعلمة و المتعلمات و بين المتعلمات وبعضهن البعض من خلال غرف الدردشة .",
            "العمل التعاونى (الجماعى) لتنفيذ بعض الأنشطة .",
          ]}
          view="https://drive.google.com/file/d/1Ae7k9nMXcb04G1SRCyaUMLIgx4qTGR9W/view?usp=sharing"
          download="https://drive.google.com/u/0/uc?id=1Ae7k9nMXcb04G1SRCyaUMLIgx4qTGR9W&export=download"
        />
      ) : (
        ""
      )}
      {pageNumber === 6 ? (
        <Post
          img={lesson6}
          lNumber="السادس/ تابع تجميل المسكن (تنفيذ قطعة لتجميل المسكن – تنفيذ مفرش) "
          unitName="أسرة متحابة"
          modrakat={[
            "وسائل تجميل المسكن.",
            "تنفيذ مفرش .",
            "الخامات و المواد الالزمة لعمل المفرش .",
            "طريقة عمل المفرش .",
            "تجميل المفرش.",
          ]}
          ahdafM={[
            "تذكر الخامات و المواد اللازمة لعمل المفرش .",
            "تشرح طريقة عمل المفرش .",
            "توضح ثلاث وسائل لتجميل المفرش كما شاهدت في الصور.",
          ]}
          ahdafW={[
            "تقدر أهمية االعمال اليدوية.",
            "تراعي الدقة عند قص المفرش.",
            "تعتني بنظافة المكان اثناء وبعد العمل.",
            "تفخر بما تصنعه بنفسها.",
          ]}
          strategies={[
            "الدراسة الذاتية عبر شبكة االأنترنت.",
            "الدراسة التقليدية وجها لوجه لمناقشة الانشطة و التكليفات و الاجابة عن الاستفسارات .",
          ]}
          methods={[
            "تحميل محتوى الموضوع من على موقع (البرنامج) .",
            "مناقشة التكليفات و الاجابة عن الاستفسارات في حجرة الدراسة التقليدية .",
            "الاستفادة من بعض المراجع و المواقع الاضافية الخاصة بالموضوع .",
            "المناقشة المفتوحة بين المعلمة و المتعلمات و بين المتعلمات وبعضهن البعض من خلال غرف الدردشة .",
            "العمل التعاونى (الجماعى) لتنفيذ بعض الأنشطة .",
          ]}
          view="https://drive.google.com/file/d/1XPs-THkOP48ubyYzCUl0U_YQXnUWX3TO/view?usp=sharing"
          download="https://drive.google.com/u/0/uc?id=1XPs-THkOP48ubyYzCUl0U_YQXnUWX3TO&export=download"
        />
      ) : (
        ""
      )}
      {pageNumber === 7 ? (
        <Test2
          view="https://drive.google.com/file/d/1c7zcRYoGpwqdSfBbFFNyf2VC5EjKDWj9/view?usp=sharing"
          download="https://drive.google.com/u/0/uc?id=1c7zcRYoGpwqdSfBbFFNyf2VC5EjKDWj9&export=download"
        />
      ) : (
        ""
      )}
    </div>
  );
};

export default Unit2;
