import React from "react";
import UnitNavigation from "../components/UnitNavigation";
import Post from "../components/Post";
import { useState } from "react";
import Pagination from "../components/parts/Pagination";
import lesson1 from "../images/1.jpg";
import lesson2 from "../images/2.jpg";
import lesson3 from "../images/3.jpg";

const Unit2 = () => {
  const [pageNumber, setPageNumber] = useState(1);
  return (
    <div className="container">
      <UnitNavigation name="الثانية" />
      <Pagination setPageNumber={setPageNumber} />
      {pageNumber === 1 ? (
        <Post
          img={lesson1}
          lNumber="الأول"
          p1="هي جزء لا يتجزأ من الصحة والرفاه اللذين يدعمان قدراتنا الفردية
          والجماعية على اتخاذ القرارات وإقامة العلاقات وتشكيل العالم الذي نعيش
          فيه. والصحة النفسية هي حق أساسي من حقوق الإنسان. وهي حاسمة الأهمية
          للتنمية الشخصية والمجتمعية والاجتماعية الاقتصادية"
          p2="في نهاية القرن العشرين للميلاد أصبح علم الاجتماع التربوي من العلوم
          المهمّة، وسعى العديدُ من فلاسفة علم الاجتماع لدراسةِ الموضوعات الخاصّة
          به، ومن أهمّها: تأثير التربية على المجتمع، وتأثر التربية بالمؤثرات
          الخاصّة بالمجتمع، والتي تختلفُ بين شعوب العالم؛ لأن كل مجتمعٍ ينظرُ
          إلى الأسس التربوية نظرةً مختلفةُ عن المجتمعات الأخرى، وذلك بسبب
          الاعتماد على العادات، والتقاليد الشائعة التي تؤثرُ تأثيراً مباشراً على
          التربية الاجتماعيّة. إقرأ المزيد على موضوع.كوم:"
          p3="هي جزء لا يتجزأ من الصحة والرفاه اللذين يدعمان قدراتنا الفردية
          والجماعية على اتخاذ القرارات وإقامة العلاقات وتشكيل العالم الذي نعيش
          فيه. والصحة النفسية هي حق أساسي من حقوق الإنسان. وهي حاسمة الأهمية
          للتنمية الشخصية والمجتمعية والاجتماعية الاقتصادية"
          youtubeSrc="https://www.youtube.com/embed/Iy6dhs2Dvrg"
          youtubeTitle="Youtube video"
        />
      ) : (
        ""
      )}
      {pageNumber === 2 ? (
        <Post
          img={lesson2}
          lNumber="الثانى"
          p1="هي جزء لا يتجزأ من الصحة والرفاه اللذين يدعمان قدراتنا الفردية
          والجماعية على اتخاذ القرارات وإقامة العلاقات وتشكيل العالم الذي نعيش
          فيه. والصحة النفسية هي حق أساسي من حقوق الإنسان. وهي حاسمة الأهمية
          للتنمية الشخصية والمجتمعية والاجتماعية الاقتصادية"
          p2="في نهاية القرن العشرين للميلاد أصبح علم الاجتماع التربوي من العلوم
          المهمّة، وسعى العديدُ من فلاسفة علم الاجتماع لدراسةِ الموضوعات الخاصّة
          به، ومن أهمّها: تأثير التربية على المجتمع، وتأثر التربية بالمؤثرات
          الخاصّة بالمجتمع، والتي تختلفُ بين شعوب العالم؛ لأن كل مجتمعٍ ينظرُ
          إلى الأسس التربوية نظرةً مختلفةُ عن المجتمعات الأخرى، وذلك بسبب
          الاعتماد على العادات، والتقاليد الشائعة التي تؤثرُ تأثيراً مباشراً على
          التربية الاجتماعيّة. إقرأ المزيد على موضوع.كوم:"
          p3="هي جزء لا يتجزأ من الصحة والرفاه اللذين يدعمان قدراتنا الفردية
          والجماعية على اتخاذ القرارات وإقامة العلاقات وتشكيل العالم الذي نعيش
          فيه. والصحة النفسية هي حق أساسي من حقوق الإنسان. وهي حاسمة الأهمية
          للتنمية الشخصية والمجتمعية والاجتماعية الاقتصادية"
          youtubeSrc="https://www.youtube.com/embed/Iy6dhs2Dvrg"
          youtubeTitle="Youtube video"
        />
      ) : (
        ""
      )}
      {pageNumber === 3 ? (
        <Post
          img={lesson3}
          lNumber="الثالث"
          p1="هي جزء لا يتجزأ من الصحة والرفاه اللذين يدعمان قدراتنا الفردية
          والجماعية على اتخاذ القرارات وإقامة العلاقات وتشكيل العالم الذي نعيش
          فيه. والصحة النفسية هي حق أساسي من حقوق الإنسان. وهي حاسمة الأهمية
          للتنمية الشخصية والمجتمعية والاجتماعية الاقتصادية"
          p2="في نهاية القرن العشرين للميلاد أصبح علم الاجتماع التربوي من العلوم
          المهمّة، وسعى العديدُ من فلاسفة علم الاجتماع لدراسةِ الموضوعات الخاصّة
          به، ومن أهمّها: تأثير التربية على المجتمع، وتأثر التربية بالمؤثرات
          الخاصّة بالمجتمع، والتي تختلفُ بين شعوب العالم؛ لأن كل مجتمعٍ ينظرُ
          إلى الأسس التربوية نظرةً مختلفةُ عن المجتمعات الأخرى، وذلك بسبب
          الاعتماد على العادات، والتقاليد الشائعة التي تؤثرُ تأثيراً مباشراً على
          التربية الاجتماعيّة. إقرأ المزيد على موضوع.كوم:"
          p3="هي جزء لا يتجزأ من الصحة والرفاه اللذين يدعمان قدراتنا الفردية
          والجماعية على اتخاذ القرارات وإقامة العلاقات وتشكيل العالم الذي نعيش
          فيه. والصحة النفسية هي حق أساسي من حقوق الإنسان. وهي حاسمة الأهمية
          للتنمية الشخصية والمجتمعية والاجتماعية الاقتصادية"
          youtubeSrc="https://www.youtube.com/embed/Iy6dhs2Dvrg"
          youtubeTitle="Youtube video"
        />
      ) : (
        ""
      )}
      {pageNumber === 4 ? (
        <Post
          img={lesson1}
          lNumber="الرابع"
          p1="هي جزء لا يتجزأ من الصحة والرفاه اللذين يدعمان قدراتنا الفردية
          والجماعية على اتخاذ القرارات وإقامة العلاقات وتشكيل العالم الذي نعيش
          فيه. والصحة النفسية هي حق أساسي من حقوق الإنسان. وهي حاسمة الأهمية
          للتنمية الشخصية والمجتمعية والاجتماعية الاقتصادية"
          p2="في نهاية القرن العشرين للميلاد أصبح علم الاجتماع التربوي من العلوم
          المهمّة، وسعى العديدُ من فلاسفة علم الاجتماع لدراسةِ الموضوعات الخاصّة
          به، ومن أهمّها: تأثير التربية على المجتمع، وتأثر التربية بالمؤثرات
          الخاصّة بالمجتمع، والتي تختلفُ بين شعوب العالم؛ لأن كل مجتمعٍ ينظرُ
          إلى الأسس التربوية نظرةً مختلفةُ عن المجتمعات الأخرى، وذلك بسبب
          الاعتماد على العادات، والتقاليد الشائعة التي تؤثرُ تأثيراً مباشراً على
          التربية الاجتماعيّة. إقرأ المزيد على موضوع.كوم:"
          p3="هي جزء لا يتجزأ من الصحة والرفاه اللذين يدعمان قدراتنا الفردية
          والجماعية على اتخاذ القرارات وإقامة العلاقات وتشكيل العالم الذي نعيش
          فيه. والصحة النفسية هي حق أساسي من حقوق الإنسان. وهي حاسمة الأهمية
          للتنمية الشخصية والمجتمعية والاجتماعية الاقتصادية"
          youtubeSrc="https://www.youtube.com/embed/Iy6dhs2Dvrg"
          youtubeTitle="Youtube video"
        />
      ) : (
        ""
      )}
      {pageNumber === 5 ? (
        <Post
          img={lesson2}
          lNumber="الخامس"
          p1="هي جزء لا يتجزأ من الصحة والرفاه اللذين يدعمان قدراتنا الفردية
          والجماعية على اتخاذ القرارات وإقامة العلاقات وتشكيل العالم الذي نعيش
          فيه. والصحة النفسية هي حق أساسي من حقوق الإنسان. وهي حاسمة الأهمية
          للتنمية الشخصية والمجتمعية والاجتماعية الاقتصادية"
          p2="في نهاية القرن العشرين للميلاد أصبح علم الاجتماع التربوي من العلوم
          المهمّة، وسعى العديدُ من فلاسفة علم الاجتماع لدراسةِ الموضوعات الخاصّة
          به، ومن أهمّها: تأثير التربية على المجتمع، وتأثر التربية بالمؤثرات
          الخاصّة بالمجتمع، والتي تختلفُ بين شعوب العالم؛ لأن كل مجتمعٍ ينظرُ
          إلى الأسس التربوية نظرةً مختلفةُ عن المجتمعات الأخرى، وذلك بسبب
          الاعتماد على العادات، والتقاليد الشائعة التي تؤثرُ تأثيراً مباشراً على
          التربية الاجتماعيّة. إقرأ المزيد على موضوع.كوم:"
          p3="هي جزء لا يتجزأ من الصحة والرفاه اللذين يدعمان قدراتنا الفردية
          والجماعية على اتخاذ القرارات وإقامة العلاقات وتشكيل العالم الذي نعيش
          فيه. والصحة النفسية هي حق أساسي من حقوق الإنسان. وهي حاسمة الأهمية
          للتنمية الشخصية والمجتمعية والاجتماعية الاقتصادية"
          youtubeSrc="https://www.youtube.com/embed/Iy6dhs2Dvrg"
          youtubeTitle="Youtube video"
        />
      ) : (
        ""
      )}
      {pageNumber === 6 ? (
        <Post
          img={lesson3}
          lNumber="السادس"
          p1="هي جزء لا يتجزأ من الصحة والرفاه اللذين يدعمان قدراتنا الفردية
          والجماعية على اتخاذ القرارات وإقامة العلاقات وتشكيل العالم الذي نعيش
          فيه. والصحة النفسية هي حق أساسي من حقوق الإنسان. وهي حاسمة الأهمية
          للتنمية الشخصية والمجتمعية والاجتماعية الاقتصادية"
          p2="في نهاية القرن العشرين للميلاد أصبح علم الاجتماع التربوي من العلوم
          المهمّة، وسعى العديدُ من فلاسفة علم الاجتماع لدراسةِ الموضوعات الخاصّة
          به، ومن أهمّها: تأثير التربية على المجتمع، وتأثر التربية بالمؤثرات
          الخاصّة بالمجتمع، والتي تختلفُ بين شعوب العالم؛ لأن كل مجتمعٍ ينظرُ
          إلى الأسس التربوية نظرةً مختلفةُ عن المجتمعات الأخرى، وذلك بسبب
          الاعتماد على العادات، والتقاليد الشائعة التي تؤثرُ تأثيراً مباشراً على
          التربية الاجتماعيّة. إقرأ المزيد على موضوع.كوم:"
          p3="هي جزء لا يتجزأ من الصحة والرفاه اللذين يدعمان قدراتنا الفردية
          والجماعية على اتخاذ القرارات وإقامة العلاقات وتشكيل العالم الذي نعيش
          فيه. والصحة النفسية هي حق أساسي من حقوق الإنسان. وهي حاسمة الأهمية
          للتنمية الشخصية والمجتمعية والاجتماعية الاقتصادية"
          youtubeSrc="https://www.youtube.com/embed/Iy6dhs2Dvrg"
          youtubeTitle="Youtube video"
        />
      ) : (
        ""
      )}
    </div>
  );
};

export default Unit2;