import React from "react";
import UnitNavigation from "../components/UnitNavigation";
import Post from "../components/Post";
import lesson1 from "../images/1.jpg";
import lesson2 from "../images/2.jpg";
import lesson3 from "../images/3.jpg";
import lesson4 from "../images/10.jpg";
import lesson5 from "../images/8.jpg";
import intro from "../images/4.jpg";
import { useState } from "react";
import Pagination from "../components/parts/Pagination";
import Intro from "../components/Intro";
import Test1 from "../components/Test1";

const Unit1 = () => {
  const [pageNumber, setPageNumber] = useState(0);

  return (
    <div className="container">
      <UnitNavigation name="الأولى" />
      <Pagination setPageNumber={setPageNumber} />

      {pageNumber === 0 ? <Intro lNumber="المقدمة" img={intro} /> : ""}

      {pageNumber === 1 ? (
        <Post
          img={lesson1}
          unitName="أسرة مفكرة"
          lNumber="الأول/ التخطيط في الاسرة"
          modrakat={[
            "مفهوم التخطيط",
            "فوائد التخطيط",
            " انواع التخطيط",
            "عوامل نجاح اي خطة",
          ]}
          ahdafM={[
            " تذكر مفهوم التخطيط في سطر من خالل الفيديو .",
            "توضح فوائد التخطيط من االشكال البصرية .",
            "تعدد أنواع التخطيط من خالل الصور و الفيديو .",
            " تعطي مثالين لخطة قصيرة المدي .",
            "تعطي ثلاثة امثلة لخطة طويلة المدي .",
          ]}
          ahdafW={[
            "تقدر فوائد التخطيط االعمال التي تقوم بها الفصل والمنزل .",
            "تهتم بعمل خطة قصيرة المدي لكل اعمالها الدراسية و المنزلية .",
            "تقدر فوائد الخطة طويلة المدى .",
            "تقدر فوائد الخطة طويلة المدى .",
          ]}
          strategies={[
            "الدراسة الذاتية عبر شبكة االنترنت .",
            "الدراسة التقليدية وجها لوجه لمناقشة االنشطة و التكليفات و االجابة عن الاستفسارات .",
          ]}
          methods={[
            "تحميل محتوى الموضوع من على موقع (البرنامج) .",
            "مناقشة التكليفات و االجابة عن االستفسارات في حجرة الدراسة التقليدية .",
            "االستفادة من بعض المراجع و المواقع االضافية الخاصة بالموضوع .",
            "المناقشة المفتوحة بين المعلمة و المتعلمات و بين المتعلمات وبعضهن البعض من خالل غرف الدردشة .",
            "العمل التعاونى (الجماعى) لتنفيذ بعض الأنشطة .",
          ]}
          view="https://drive.google.com/file/d/1vfF3dUEzP0fy5w1akNB5T4x5cId3r1OP/view?usp=sharing"
          download="https://drive.google.com/u/0/uc?id=1vfF3dUEzP0fy5w1akNB5T4x5cId3r1OP&export=download"
        />
      ) : (
        ""
      )}
      {pageNumber === 2 ? (
        <Post
          img={lesson2}
          lNumber="الثانى/ العناصر الغذائية"
          unitName="أسرة مفكرة"
          modrakat={[
            "العناصر الغذائية الضرورية للجسم .",
            "نظم تقسيم العناصر الغذائية .",
            " فائدة كل مجموعة من مجموعات الغذاء .",
          ]}
          ahdafM={[
            " تذكر العناصر الغذائية الضرورية للجسم من خلال الفيديو  .",
            "توضح فائدتين لمجموعة البناء من خالل الفيديو .",
            "تعدد اطعمة مجموعة الوقاية من الصور المرفقة .",
            " تعطي مثالين ألطعمة الطاقة من الصور المعروضة .",
            "توضح أهمية مجموعة الوقاية للجسم في سطرين .",
          ]}
          ahdafW={[
            "تقدر أهمية الغذاء السليم لجسمها .",
            "تعتني باختيار العناصر الغذائية التي يحتاجها جسمها .",
            "تحسن استخدام الموارد المتاحة لديها في غذائها .",
          ]}
          strategies={[
            "الدراسة الذاتية عبر شبكة الأنترنت .",
            "الدراسة التقليدية وجها لوجه لمناقشة الأنشطة و التكليفات و الإجابة عن الاستفسارات .",
          ]}
          methods={[
            "تحميل محتوى الموضوع من على موقع (البرنامج) .",
            "مناقشة التكليفات و الاجابة عن الاستفسارات في حجرة الدراسة التقليدية .",
            "الاستفادة من بعض المراجع و المواقع الاضافية الخاصة بالموضوع .",
            "المناقشة المفتوحة بين المعلمة و المتعلمات و بين المتعلمات وبعضهن البعض من خلال غرف الدردشة .",
            "العمل التعاونى (الجماعى) لتنفيذ بعض الأنشطة .",
          ]}
          view="https://drive.google.com/file/d/106yD558qPwD5osbLgBF_eFuX2XCsxe5g/view?usp=sharing"
          download="https://drive.google.com/u/0/uc?id=106yD558qPwD5osbLgBF_eFuX2XCsxe5g&export=download"
        />
      ) : (
        ""
      )}
      {pageNumber === 3 ? (
        <Post
          img={lesson3}
          lNumber="الثالث/ تخطيط وجبات غذائية متكاملة"
          unitName="أسرة مفكرة"
          modrakat={[
            "اعداد قائمة لوجبات غذاء متكاملة .",
            "العوامل التي تؤثر علي اختيار نوع وكميات الوجبات الغذائية (عدد افراد الاسرة – السن – حالة الجو – الحالة الصحية – نوع العمل) . ",
            " انواع التخطيط",
            "عوامل نجاح اي خطة",
          ]}
          ahdafM={[
            " تحدد العوامل التي تؤثر علي اختيار نوع وكمية الغذاء .",
            "توضح فوائد التخطيط من االشكال البصرية .",
            "تعدد أنواع التخطيط من خالل الصور و الفيديو .",
            " تعد قائمة لوجبات غذائية متكاملة ليوم كامل ألسرتها .",
            "تذكر طرق الطهي المستخدمة .",
          ]}
          ahdafW={[
            "تحسن استخدام الموارد المتاحة لديها لعمل وجبات متكاملة .",
            "تهتم بالغذاء الصحي في جميع وجباتها .",
          ]}
          strategies={[
            "الدراسة الذاتية عبر شبكة االنترنت .",
            "الدراسة التقليدية وجها لوجه لمناقشة االنشطة و التكليفات و االجابة عن الاستفسارات .",
          ]}
          methods={[
            "تحميل محتوى الموضوع من على موقع (البرنامج) .",
            "مناقشة التكليفات و االجابة عن االستفسارات في حجرة الدراسة التقليدية .",
            "االستفادة من بعض المراجع و المواقع االضافية الخاصة بالموضوع .",
            "المناقشة المفتوحة بين المعلمة و المتعلمات و بين المتعلمات وبعضهن البعض من خالل غرف الدردشة .",
            "العمل التعاونى (الجماعى) لتنفيذ بعض الأنشطة .",
          ]}
          view="https://drive.google.com/file/d/1jZajQcd_7zNirQ-2YDXNq_CBnDjaa1X8/view?usp=sharing"
          download="https://drive.google.com/u/0/uc?id=1jZajQcd_7zNirQ-2YDXNq_CBnDjaa1X8&export=download"
        />
      ) : (
        ""
      )}
      {pageNumber === 4 ? (
        <Post
          img={lesson4}
          lNumber="الرابع/ بعض الاصناف المتكاملة ( البيتزا )"
          unitName="أسرة مفكرة"
          modrakat={[
            "مكونات البيتزا .",
            "طريقة عمل البيتزا .",
            " القيمة الغذائية للبيتزا .",
            "القيمة االقتصادية للبيتزا .",
          ]}
          ahdafM={[
            " تعطي ثالثة نماذج لوجبات غذائية متكاملة العناصر .",
            "تذكر المكونات االساسية لعمل البيتزا .",
            "تعدد أنواع التخطيط من خالل الصور و الفيديو .",
            " تشرح طريقة عمل البيتزا .",
            "تستنتج القيمة الغذائية للبيتزا .",
            "تحسب تكاليف االصنف التي قامت بعمله .",
          ]}
          ahdafW={[
            "تقدر أهمية تناولها وجبات متكاملة العناصر الغذائية .",
            "تفخر بما تصنعه بنفسها .",
          ]}
          strategies={[
            "الدراسة الذاتية عبر شبكة االنترنت .",
            "الدراسة التقليدية وجها لوجه لمناقشة االنشطة و التكليفات و االجابة عن الاستفسارات .",
          ]}
          methods={[
            "تحميل محتوى الموضوع من على موقع (البرنامج) .",
            "مناقشة التكليفات و االجابة عن االستفسارات في حجرة الدراسة التقليدية .",
            "االستفادة من بعض المراجع و المواقع االضافية الخاصة بالموضوع .",
            "المناقشة المفتوحة بين المعلمة و المتعلمات و بين المتعلمات وبعضهن البعض من خالل غرف الدردشة .",
            "العمل التعاونى (الجماعى) لتنفيذ بعض الأنشطة .",
          ]}
          view="https://drive.google.com/file/d/1yRI7GzpQXZItjNJa3PANbDfue5BhFXYX/view?usp=sharing"
          download="https://drive.google.com/u/0/uc?id=1yRI7GzpQXZItjNJa3PANbDfue5BhFXYX&export=download"
        />
      ) : (
        ""
      )}
      {pageNumber === 5 ? (
        <Post
          img={lesson5}
          lNumber="الخامس/ بعض الاصناف المتكاملة ( جلاش باللحمة المفرومة )"
          unitName="أسرة مفكرة"
          modrakat={[
            "مكونات كيك الشيكولاته.",
            "طريقة كيك الشيكولاته .",
            "القيمة الغذائية كيك الشيكولاته .",
            "القيمة االقتصادية كيك الشيكولاته.",
          ]}
          ahdafM={[
            "تعطي ثالثة نماذج لوجبات غذائية متكاملة العناصر .",
            "تذكر مكونات كيك الشيكوالتة كما شاهدتها بالفيديو بدقة .",
            "تشرح طريقة كيك الشيكوالتة كما شاهدتها بالفيديو بسهولة .",
            "تستنتج القيمة الغذائية كيك الشيكوالتة من الفيديو ."
          ]}
          ahdafW={[
            "تهتم بتناول وجبات متكاملة العناصر الغذائية .",
            "تقدر اهمية العمل اليدوي .",
            "تعتني بنظافة المكان اثناء وبعد العمل .",
            "تتعاون مع زميالتها اثناء العمل .",
            "تفخر بما تصنعه بنفسها ."
          ]}
          strategies={[
            "الدراسة الذاتية عبر شبكة االنترنت .",
            "الدراسة التقليدية وجها لوجه لمناقشة االنشطة و التكليفات و االجابة عن الاستفسارات .",
          ]}
          methods={[
            "تحميل محتوى الموضوع من على موقع (البرنامج) .",
            "مناقشة التكليفات و االجابة عن االستفسارات في حجرة الدراسة التقليدية .",
            "االستفادة من بعض المراجع و المواقع االضافية الخاصة بالموضوع .",
            "المناقشة المفتوحة بين المعلمة و المتعلمات و بين المتعلمات وبعضهن البعض من خالل غرف الدردشة .",
            "العمل التعاونى (الجماعى) لتنفيذ بعض الأنشطة .",
          ]}
          view="https://drive.google.com/file/d/1em-mnLGavHqK5D6yK1_R2HcpqYeT6HDm/view?usp=sharing"
          download="https://drive.google.com/u/0/uc?id=1em-mnLGavHqK5D6yK1_R2HcpqYeT6HDm&export=download"
        />
      ) : (
        ""
      )}
      {pageNumber === 6 ? (
        <Post
          img={lesson3}
          lNumber="السادس/ ترتيب ادوات المائدة "
          unitName="أسرة مفكرة"
          modrakat={[
            "طرق اعداد المائدة للوجبات المختلفة",
            "ادوات المائدة واستخدام كالً منها (المفارش والفوط - الاطباق - القضية - الاكواب - ادوات تجميل المائدة)",
            " طرق رفع االدوات بعد تناول الطعام .",
            "طرق تجميل المائدة",
          ]}
          ahdafM={[
            "تذكر طريقة من طرق إعداد المائدة للوجبات المختلفة .",
            "تعدد أدوات المائدة و استخدام كل منها من خالل الصور المعروضة .",
            "توضح المقصود بالفضية .",
            "تبين طريقتين لتجميل المائدة بالصور.",
            "تشرح طريقة رفع االطباق من علي المائدة .",
            "تختار مفرش نظيف وانيق للمائدة ."
          ]}
          ahdafW={[
      "تحرص علي تجهيز المائدة بطريقة شيقة .",
      "تتعاون مع زميالتها عند اعداد مائدة حجرة االقتصاد المنزلي.",
      "تتقن ترتيب ادوات مائدة حجرة االقتصاد المنزلي ."
          ]}
          strategies={[
            "الدراسة الذاتية عبر شبكة االنترنت .",
            "الدراسة التقليدية وجها لوجه لمناقشة االنشطة و التكليفات و االجابة عن الاستفسارات .",
          ]}
          methods={[
            "تحميل محتوى الموضوع من على موقع (البرنامج) .",
            "مناقشة التكليفات و االجابة عن االستفسارات في حجرة الدراسة التقليدية .",
            "االستفادة من بعض المراجع و المواقع االضافية الخاصة بالموضوع .",
            "المناقشة المفتوحة بين المعلمة و المتعلمات و بين المتعلمات وبعضهن البعض من خالل غرف الدردشة .",
            "العمل التعاونى (الجماعى) لتنفيذ بعض الأنشطة .",
          ]}
          view="https://drive.google.com/file/d/1ghRQXJFHdVQlk8K6AaHDwm2VwsxC3RFS/view?usp=sharing"
          download="https://drive.google.com/u/0/uc?id=1ghRQXJFHdVQlk8K6AaHDwm2VwsxC3RFS&export=download"
        />
      ) : (
        ""
      )}
       {pageNumber === 7 ? (
        <Test1
        view="https://drive.google.com/file/d/1LdmwvESxN_eGC6FX3MpitqE3H-uzj9r6/view?usp=sharing"
        download="https://drive.google.com/u/0/uc?id=1LdmwvESxN_eGC6FX3MpitqE3H-uzj9r6&export=download"
        />
      ) : (
        ""
      )}
    </div>
  );
};

export default Unit1;
