import React from "react";
import UnitNavigation from "../components/UnitNavigation";
import Post from "../components/Post";
import lesson1 from "../images/1.jpg";
import lesson2 from "../images/2.jpg";
import lesson3 from "../images/3.jpg";
import intro from "../images/4.jpg";
import { useState } from "react";
import Pagination from "../components/parts/Pagination";
import Intro from "../components/Intro";

const Unit1 = () => {
  const [pageNumber, setPageNumber] = useState(0);

  return (
    <div className="container">
      <UnitNavigation name="الأولى" />
      <Pagination setPageNumber={setPageNumber} />

      {pageNumber === 0 ? <Intro lNumber="المقدمة" img={intro} /> : ""}

      {pageNumber === 1 ? (
        <Post
          img={lesson1}
          unitName="أسرة مفكرة"
          lNumber="الأول/ التخطيط في الاسرة"
          modrakat={[
            "مفهوم التخطيط",
            "فوائد التخطيط",
            " انواع التخطيط",
            "عوامل نجاح اي خطة",
          ]}
          ahdafM={[
            " تذكر مفهوم التخطيط في سطر من خالل الفيديو .",
            "توضح فوائد التخطيط من االشكال البصرية .",
            "تعدد أنواع التخطيط من خالل الصور و الفيديو .",
            " تعطي مثالين لخطة قصيرة المدي .",
            "تعطي ثلاثة امثلة لخطة طويلة المدي .",
          ]}
          ahdafW={[
            "تقدر فوائد التخطيط االعمال التي تقوم بها الفصل والمنزل .",
            "تهتم بعمل خطة قصيرة المدي لكل اعمالها الدراسية و المنزلية .",
            "تقدر فوائد الخطة طويلة المدى .",
            "تقدر فوائد الخطة طويلة المدى .",
          ]}
          strategies={[
            "الدراسة الذاتية عبر شبكة االنترنت .",
            "الدراسة التقليدية وجها لوجه لمناقشة االنشطة و التكليفات و االجابة عن الاستفسارات .",
          ]}
          methods={[
            "تحميل محتوى الموضوع من على موقع (البرنامج) .",
            "مناقشة التكليفات و االجابة عن االستفسارات في حجرة الدراسة التقليدية .",
            "االستفادة من بعض المراجع و المواقع االضافية الخاصة بالموضوع .",
            "المناقشة المفتوحة بين المعلمة و المتعلمات و بين المتعلمات وبعضهن البعض من خالل غرف الدردشة .",
            "العمل التعاونى (الجماعى) لتنفيذ بعض الأنشطة ."
          ]}
        />
      ) : (
        ""
      )}
      {pageNumber === 2 ? (
        <Post
          img={lesson2}
          lNumber="الثانى/ العناصر الغذائية"
          p1="هي جزء لا يتجزأ من الصحة والرفاه اللذين يدعمان قدراتنا الفردية
          والجماعية على اتخاذ القرارات وإقامة العلاقات وتشكيل العالم الذي نعيش
          فيه. والصحة النفسية هي حق أساسي من حقوق الإنسان. وهي حاسمة الأهمية
          للتنمية الشخصية والمجتمعية والاجتماعية الاقتصادية"
          p2="في نهاية القرن العشرين للميلاد أصبح علم الاجتماع التربوي من العلوم
          المهمّة، وسعى العديدُ من فلاسفة علم الاجتماع لدراسةِ الموضوعات الخاصّة
          به، ومن أهمّها: تأثير التربية على المجتمع، وتأثر التربية بالمؤثرات
          الخاصّة بالمجتمع، والتي تختلفُ بين شعوب العالم؛ لأن كل مجتمعٍ ينظرُ
          إلى الأسس التربوية نظرةً مختلفةُ عن المجتمعات الأخرى، وذلك بسبب
          الاعتماد على العادات، والتقاليد الشائعة التي تؤثرُ تأثيراً مباشراً على
          التربية الاجتماعيّة. إقرأ المزيد على موضوع.كوم:"
          p3="هي جزء لا يتجزأ من الصحة والرفاه اللذين يدعمان قدراتنا الفردية
      والجماعية على اتخاذ القرارات وإقامة العلاقات وتشكيل العالم الذي نعيش
      فيه. والصحة النفسية هي حق أساسي من حقوق الإنسان. وهي حاسمة الأهمية
      للتنمية الشخصية والمجتمعية والاجتماعية الاقتصادية"
          youtubeSrc="https://www.youtube.com/embed/Iy6dhs2Dvrg"
          youtubeTitle="Youtube video"
        />
      ) : (
        ""
      )}
      {pageNumber === 3 ? (
        <Post
          img={lesson3}
          lNumber="الثالث/ تخطيط وجبات غذائية متكاملة"
          p1="هي جزء لا يتجزأ من الصحة والرفاه اللذين يدعمان قدراتنا الفردية
          والجماعية على اتخاذ القرارات وإقامة العلاقات وتشكيل العالم الذي نعيش
          فيه. والصحة النفسية هي حق أساسي من حقوق الإنسان. وهي حاسمة الأهمية
          للتنمية الشخصية والمجتمعية والاجتماعية الاقتصادية"
          p2="في نهاية القرن العشرين للميلاد أصبح علم الاجتماع التربوي من العلوم
          المهمّة، وسعى العديدُ من فلاسفة علم الاجتماع لدراسةِ الموضوعات الخاصّة
          به، ومن أهمّها: تأثير التربية على المجتمع، وتأثر التربية بالمؤثرات
          الخاصّة بالمجتمع، والتي تختلفُ بين شعوب العالم؛ لأن كل مجتمعٍ ينظرُ
          إلى الأسس التربوية نظرةً مختلفةُ عن المجتمعات الأخرى، وذلك بسبب
          الاعتماد على العادات، والتقاليد الشائعة التي تؤثرُ تأثيراً مباشراً على
          التربية الاجتماعيّة. إقرأ المزيد على موضوع.كوم:"
          p3="هي جزء لا يتجزأ من الصحة والرفاه اللذين يدعمان قدراتنا الفردية
      والجماعية على اتخاذ القرارات وإقامة العلاقات وتشكيل العالم الذي نعيش
      فيه. والصحة النفسية هي حق أساسي من حقوق الإنسان. وهي حاسمة الأهمية
      للتنمية الشخصية والمجتمعية والاجتماعية الاقتصادية"
          youtubeSrc="https://www.youtube.com/embed/Iy6dhs2Dvrg"
          youtubeTitle="Youtube video"
        />
      ) : (
        ""
      )}
      {pageNumber === 4 ? (
        <Post
          img={lesson1}
          lNumber="الرابع/ بعض الاصناف المتكاملة ( البيتزا )

          "
          p1="هي جزء لا يتجزأ من الصحة والرفاه اللذين يدعمان قدراتنا الفردية
          والجماعية على اتخاذ القرارات وإقامة العلاقات وتشكيل العالم الذي نعيش
          فيه. والصحة النفسية هي حق أساسي من حقوق الإنسان. وهي حاسمة الأهمية
          للتنمية الشخصية والمجتمعية والاجتماعية الاقتصادية"
          p2="في نهاية القرن العشرين للميلاد أصبح علم الاجتماع التربوي من العلوم
          المهمّة، وسعى العديدُ من فلاسفة علم الاجتماع لدراسةِ الموضوعات الخاصّة
          به، ومن أهمّها: تأثير التربية على المجتمع، وتأثر التربية بالمؤثرات
          الخاصّة بالمجتمع، والتي تختلفُ بين شعوب العالم؛ لأن كل مجتمعٍ ينظرُ
          إلى الأسس التربوية نظرةً مختلفةُ عن المجتمعات الأخرى، وذلك بسبب
          الاعتماد على العادات، والتقاليد الشائعة التي تؤثرُ تأثيراً مباشراً على
          التربية الاجتماعيّة. إقرأ المزيد على موضوع.كوم:"
          p3="هي جزء لا يتجزأ من الصحة والرفاه اللذين يدعمان قدراتنا الفردية
      والجماعية على اتخاذ القرارات وإقامة العلاقات وتشكيل العالم الذي نعيش
      فيه. والصحة النفسية هي حق أساسي من حقوق الإنسان. وهي حاسمة الأهمية
      للتنمية الشخصية والمجتمعية والاجتماعية الاقتصادية"
          youtubeSrc="https://www.youtube.com/embed/Iy6dhs2Dvrg"
          youtubeTitle="Youtube video"
        />
      ) : (
        ""
      )}
      {pageNumber === 5 ? (
        <Post
          img={lesson2}
          lNumber="الخامس/ بعض الاصناف المتكاملة ( جلاش باللحمة المفرومة )

          "
          p1="هي جزء لا يتجزأ من الصحة والرفاه اللذين يدعمان قدراتنا الفردية
          والجماعية على اتخاذ القرارات وإقامة العلاقات وتشكيل العالم الذي نعيش
          فيه. والصحة النفسية هي حق أساسي من حقوق الإنسان. وهي حاسمة الأهمية
          للتنمية الشخصية والمجتمعية والاجتماعية الاقتصادية"
          p2="في نهاية القرن العشرين للميلاد أصبح علم الاجتماع التربوي من العلوم
          المهمّة، وسعى العديدُ من فلاسفة علم الاجتماع لدراسةِ الموضوعات الخاصّة
          به، ومن أهمّها: تأثير التربية على المجتمع، وتأثر التربية بالمؤثرات
          الخاصّة بالمجتمع، والتي تختلفُ بين شعوب العالم؛ لأن كل مجتمعٍ ينظرُ
          إلى الأسس التربوية نظرةً مختلفةُ عن المجتمعات الأخرى، وذلك بسبب
          الاعتماد على العادات، والتقاليد الشائعة التي تؤثرُ تأثيراً مباشراً على
          التربية الاجتماعيّة. إقرأ المزيد على موضوع.كوم:"
          p3="هي جزء لا يتجزأ من الصحة والرفاه اللذين يدعمان قدراتنا الفردية
      والجماعية على اتخاذ القرارات وإقامة العلاقات وتشكيل العالم الذي نعيش
      فيه. والصحة النفسية هي حق أساسي من حقوق الإنسان. وهي حاسمة الأهمية
      للتنمية الشخصية والمجتمعية والاجتماعية الاقتصادية"
          youtubeSrc="https://www.youtube.com/embed/Iy6dhs2Dvrg"
          youtubeTitle="Youtube video"
        />
      ) : (
        ""
      )}
      {pageNumber === 6 ? (
        <Post
          img={lesson3}
          lNumber="السادس/ ترتيب ادوات المائدة "
          p1="هي جزء لا يتجزأ من الصحة والرفاه اللذين يدعمان قدراتنا الفردية
          والجماعية على اتخاذ القرارات وإقامة العلاقات وتشكيل العالم الذي نعيش
          فيه. والصحة النفسية هي حق أساسي من حقوق الإنسان. وهي حاسمة الأهمية
          للتنمية الشخصية والمجتمعية والاجتماعية الاقتصادية"
          p2="في نهاية القرن العشرين للميلاد أصبح علم الاجتماع التربوي من العلوم
          المهمّة، وسعى العديدُ من فلاسفة علم الاجتماع لدراسةِ الموضوعات الخاصّة
          به، ومن أهمّها: تأثير التربية على المجتمع، وتأثر التربية بالمؤثرات
          الخاصّة بالمجتمع، والتي تختلفُ بين شعوب العالم؛ لأن كل مجتمعٍ ينظرُ
          إلى الأسس التربوية نظرةً مختلفةُ عن المجتمعات الأخرى، وذلك بسبب
          الاعتماد على العادات، والتقاليد الشائعة التي تؤثرُ تأثيراً مباشراً على
          التربية الاجتماعيّة. إقرأ المزيد على موضوع.كوم:"
          p3="هي جزء لا يتجزأ من الصحة والرفاه اللذين يدعمان قدراتنا الفردية
      والجماعية على اتخاذ القرارات وإقامة العلاقات وتشكيل العالم الذي نعيش
      فيه. والصحة النفسية هي حق أساسي من حقوق الإنسان. وهي حاسمة الأهمية
      للتنمية الشخصية والمجتمعية والاجتماعية الاقتصادية"
          youtubeSrc="https://www.youtube.com/embed/Iy6dhs2Dvrg"
          youtubeTitle="Youtube video"
        />
      ) : (
        ""
      )}
    </div>
  );
};

export default Unit1;
