import React from "react";
import Container from "react-bootstrap/Container";

const Intro = ({ lNumber,img }) => {
  return (
    <div className="post p-5">
      <Container className="px-lg-5">
        <h1 className="text-center pb-4" style={{"fontSize": "1.5rem"}}>مقدمة الوحدة الأولى (أسرة مفكرة) </h1>
        <figure className="figure my-4">
          <img
            src={img}
            className="figure-img img-fluid rounded "
            alt="lesson 1"
          ></img>
        </figure>
        <p>
          من خلال اللقاء التمهيدي مع التلميذات وبعد القاء السلام علي التلميذات ،
          وتهنئتهن بالعام الدراسي الجديد وتمنياتي لهن بالنجاح و التفوق و التوفيق
          ان شاء الله ، ثم التعرف علي التلميذات ، وتعريفهن بنفسي و بالمادة .
        </p>
        <p className="pb-3">سيتم تهيئة الوحدة :</p>
        <p className="pb-3">
          اقوم بسؤال التلميذات عندما تواجهك مشكله شخصية أو تواجه اسرتك مشكلة
          عائلية ماذا تفعلي أو كيف تتصرف اسرتك ؟
        </p>
        <p className="pb-3">
          استمع لآرائهن و استجابتهن ونتناقش فيها ، وأسألهن ن العملية التي يقوموا
          بها حتي يصلوا الي حل المشكلة حتي نصل الي التفكير
        </p>
        <p className="pb-3">ثم أسألهن عن أهمية التفكير في كل امور حياتنا ؟</p>
        <p className="pb-3">
          اتلقي استجابتهن ثم أوضح لهن ان الاسرة المفكرة تصل الي حل المشكلات التي
          تواجهها و تحقيق أهدافها بنجاح بالتفكير السليم وبالتالي اتخاذ القرار
          المناسب وذلك في جميع المواقف الحياتية
        </p>
        <p className="pb-3">وهذا هو موضوع وحدتنا ( اسرة مفكرة )</p>
        <h3 className="pb-3" style={{"fontSize": "1.3rem"}}>دروس الوحدة :</h3>
        <ul>
          <li>
            <p>التخطيط في الاسرة</p>
          </li>
          <li>
            <p>العناصر الغذائية </p>
          </li>
          <li>
            <p>تخطيط وجبات غذائية متكاملة</p>
          </li>
          <li>
            <p>بعض الاصناف المتكاملة  ( البيتزا )</p>
          </li>
          <li>
            <p>بعض الاصناف المتكاملة (  جلاش باللحمة المفرومة )</p>
          </li>
          <li>
            <p>ترتيب ادوات المائدة </p>
          </li>
        </ul>
      </Container>
    </div>
  );
};

export default Intro;
